new/Rails/projects/ArtshareAPI/app/controllers/artwoek_shares_controller.rb

  def create
    artwork_share = ArtwoekShare.new(artwoek_shares_params)

    if artwork_share.save
---
INSERT INTO "artwoek_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 1], ["viewer_id", 1], ["created_at", "2022-09-25 13:36:46.163782"], ["updated_at", "2022-09-25 13:36:46.163782"]]