new/Rails/projects/ArtshareAPI/app/controllers/artworks_controller.rb

  def index
    artist = User.find_by(id: params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]