new/Rails/projects/ArtshareAPI/app/controllers/comments_controller.rb

  def index
    case
    when params[:user_id]
      comments = Comment.where(user_id: params[:user_id])
    when params[:artwork_id]
      comments = Comment.where(artwork_id: params[:artwork_id])
    else
      comments = Comment.all
---
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 2]]
SELECT "comments".* FROM "comments"

  def create
    comment = Comment.new(comment_params)

    if comment.save
---
INSERT INTO "comments" ("body", "author_id", "artwork_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "awesome work!"], ["author_id", 1], ["artwork_id", 2], ["created_at", "2022-09-26 11:48:02.956958"], ["updated_at", "2022-09-26 11:48:02.956958"]]