new/Rails/projects/ArtshareAPI/app/controllers/users_controller.rb

  def index
    if params[:query]
      users = User.where('username like ?', "%#{params[:query]}%")
    else
      users = User.all
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "\"bob\""], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE (username like 'bob')

  def destroy
    user = User.find_by(id: params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

  def update
    user = User.find_by(id: params[:id])
    if user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "halolo"], ["updated_at", "2022-09-25 13:12:02.792626"], ["id", 4]]