new/Rails/Controller/apps/dummy2/app/controllers/books_controller.rb

SELECT "books".* FROM "books"
---
  def new
    @books = Book.all