new/Rails/projects/cats/app/controllers/cats_controller.rb

INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @cat = Cat.new(cat_params)

    if @cat.save

SELECT "cats".* FROM "cats" WHERE "cats"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
   def update
    @cat = Cat.find_by(id: params[:id])