new/SQL/AR/shortener/app/models/shortend_url.rb

    def self.random_code
        loop do
            random_link = SecureRandom.urlsafe_base64(16)
            return random_link unless ShortendUrl.exists?(short_url: random_link)
---
SELECT 1 AS one FROM "shortend_urls" WHERE "shortend_urls"."short_url" = ? LIMIT ?  [["short_url", "R03_RvKBFG6tIdkFGFBZZA"], ["LIMIT", 1]]

    def self.create_for_user_and_long_url!(user, long_url)
---
INSERT INTO "shortend_urls" ("short_url", "long_url", "submitter_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["short_url", "R03_RvKBFG6tIdkFGFBZZA"], ["long_url", "google.com"], ["submitter_id", "2"], ["created_at", "2022-08-30 17:38:05.601814"], ["updated_at", "2022-08-30 17:38:05.601814"]]