new/SQL/AR/shortener/app/models/visit.rb

INSERT INTO "visits" ("shortend_url_id", "visitor_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["shortend_url_id", "5"], ["visitor_id", "2"], ["created_at", "2022-08-30 17:39:14.668329"], ["updated_at", "2022-08-30 17:39:14.668329"]]
---
    def self.record_visit!(user, shortend_url)
        Visit.create!(visitor_id: user.id, shortend_url_id: shortend_url.id)