new/Rails/Controller/apps/dummy1/app/controllers/cats_controller.rb

INSERT INTO "cats" ("name", "created_at", "updated_at", "skill") VALUES (?, ?, ?, ?)  [["name", "Earl"], ["created_at", "2022-09-21 09:52:48.156532"], ["updated_at", "2022-09-21 09:52:48.156532"], ["skill", "jumbing"]]
---
  def create
    @cat = Cat.new(cat_params)
    if @cat.save

SELECT "cats".* FROM "cats" WHERE "cats"."id" = ? LIMIT ?  [["id", 28], ["LIMIT", 1]]
DELETE FROM "cats" WHERE "cats"."id" = ?  [["id", 28]]
---
  def destroy
    @cat = Cat.find(params[:id])
    @cat.destroy