new/Rails/Controller/apps/dummy1/app/controllers/toys_controller.rb

SELECT "cats".* FROM "cats" WHERE "cats"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def index
        cat = Cat.find(params[:cat_id])

SELECT "toys".* FROM "toys" WHERE "toys"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        toy = Toy.find(params[:id])

INSERT INTO "toys" ("name", "toy_type", "cat_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Ms. mouse"], ["toy_type", "mouse"], ["cat_id", 29], ["created_at", "2022-09-21 10:57:32.517539"], ["updated_at", "2022-09-21 10:57:32.517539"]]
---
    def create

        @toy = Toy.new(self.toys_params)
        @cat = @toy.cat
        if @toy.save

SELECT "toys".* FROM "toys" WHERE "toys"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "toys" SET "name" = ?, "toy_type" = ?, "updated_at" = ? WHERE "toys"."id" = ?  [["name", "toy_111"], ["toy_type", "ball"], ["updated_at", "2022-09-20 10:18:12.749326"], ["id", 2]]
---
    def update
        toy = Toy.find(params[:id])
        success = toy.update(self.toys_params)

SELECT "cats".* FROM "cats" WHERE "cats"."id" = ? LIMIT ?  [["id", 29], ["LIMIT", 1]]
---
    def new
        @cat = Cat.find(params[:cat_id])