new/Rails/Controller/apps/library/app/controllers/books_controller.rb

    def show
        @book = Book.find_by(id: params[:id])
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        @book = Book.new(book_params)
        if @book.save
---
INSERT INTO "books" ("title", "author", "year", "category", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

    def edit
        @book = Book.find_by(id: params[:id])
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def update
        @book = Book.find_by(id: params[:id])

        if @book.update(book_params)
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "author" = ?, "year" = ?, "description" = ?, "updated_at" = ? WHERE "books"."id" = ?