new/Rails/Controller/apps/dummy1/app/views/cats/show.html.erb

SELECT "toys".* FROM "toys" WHERE "toys"."cat_id" = ?  [["cat_id", 1]]
---
<ul>
    <% @cat.toys.each do |toy| %>