new/Rails/Controller/apps/heros/app/controllers/superheros_controller.rb

  def index
    render json: Superhero.all
---
SELECT "superheros".* FROM "superheros"

  def show
    @superhero = Superhero.find(params[:id])
---
SELECT "superheros".* FROM "superheros" WHERE "superheros"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def create
    @superhero = Superhero.new(superhero_params)
    if @superhero.save
---
INSERT INTO "superheros" ("name", "superpower", "secret_identity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "tets"], ["superpower", "3el2"], ["secret_identity", "[FILTERED]"], ["created_at", "2022-07-01 08:49:53.550007"], ["updated_at", "2022-07-01 08:49:53.550007"]]

  def update
    @superhero = Superhero.find(params[:id])
    if @superhero.update(superhero_params)
---
SELECT "superheros".* FROM "superheros" WHERE "superheros"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "superheros" SET "name" = ?, "superpower" = ?, "updated_at" = ? WHERE "superheros"."id" = ?  [["name", "beb"], ["superpower", "bleb"], ["updated_at", "2022-07-01 08:38:14.835187"], ["id", 1]]