new/Rails/projects/firstrails/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "abdo"], ["email", "abdo@yahoo"], ["created_at", "2022-09-24 08:46:10.316363"], ["updated_at", "2022-09-24 08:46:10.316363"]]
---
    def create
        user = User.new(user_params)
        if user.save